Zero Hole Ball/Zero/pickleball_zero_final_23.0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       97552;
    }
    outlet
    {
        type            patch;
        nFaces          719;
        startFace       97752;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1569;
        startFace       98471;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1858;
        startFace       100040;
    }
    buildings
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3018;
        startFace       101898;
    }
)

// ************************************************************************* //
